app/Controllers/Dashboard.php

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function index()
    {
        // Check if user is logged in
        if (!session()->has('user_id')) {
            return redirect()->to('auth/login');
        }

        // Retrieve user data using UserModel
        $user_id = session()->get('user_id');
        $user = $this->userModel->find($user_id);

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function profile()
    {
        // Check if user is logged in
        if (!session()->has('user_id')) {
            return redirect()->to('auth/login');
        }

        // Retrieve user data using UserModel
        $user_id = session()->get('user_id');
        $user = $this->userModel->find($user_id);

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function search()
    {
        // Check if the user is logged in
        if (session()->has('user_id')) {
            $user = $this->userModel->find(session('user_id'));